import dependencies

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

data loading

In [2]:
data = {
    'Name': ['Arun', 'Ravi', 'Mohan', 'Sita', 'Geeta'],
    'Age': [25, 30, 22, 28, 24],
    'Salary': [50000, 60000, 52000, 58000, 55000],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Chennai', 'Pune']
}
df = pd.DataFrame(data)
df

    Name  Age  Salary     City
0   Arun   25   50000    Noida
1   Ravi   30   60000    Delhi
2  Mohan   22   52000   Mumbai
3   Sita   28   58000  Chennai
4  Geeta   24   55000     Pune

In [3]:
#how to save data in diffrent format
df.to_csv('my_data.csv')#csv format

In [4]:
#how to save excel format
df.to_excel('my_data.xlsx')#excel format save

In [5]:
#how to save html format
df.to_html('my_data.html')

In [6]:
#how to save json format
df.to_json('my_data.json')

how to load data diffent format

In [8]:
data_csv = pd.read_csv('my_data.csv')
data_html = pd.read_html('my_data.html')
data_json = pd.read_json('my_data.json')
excel_data = pd.read_excel('my_data.xlsx')

In [9]:
data_csv

   Unnamed: 0   Name  Age  Salary     City
0           0   Arun   25   50000    Noida
1           1   Ravi   30   60000    Delhi
2           2  Mohan   22   52000   Mumbai
3           3   Sita   28   58000  Chennai
4           4  Geeta   24   55000     Pune

data explore

In [10]:
#head
#shape
#describe
#info
#coulumns
#null values
print(data_csv.shape)

(5, 5)

In [11]:
data_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         5 non-null      int64
 3   Salary      5 non-null      int64
 4   City        5 non-null      object
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes

In [12]:
data_csv.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Salary', 'City'], dtype='object')

In [13]:
data_csv.describe()

       Unnamed: 0        Age        Salary
count    5.000000   5.000000      5.000000
mean     2.000000  25.800000  55000.000000
std      1.581139   3.193744   4123.105626
min      0.000000  22.000000  50000.000000
25%      1.000000  24.000000  52000.000000
50%      2.000000  25.000000  55000.000000
75%      3.000000  28.000000  58000.000000
max      4.000000  30.000000  60000.000000

In [14]:
data_csv.isnull().sum()

Unnamed: 0    0
Name          0
Age           0
Salary        0
City          0
dtype: int64

In [16]:
data_csv.duplicated().sum()

0

Top 5 rows dekhna: df.head()
Last 5 rows dekhna: df.tail()
Data ka size dekhna: df.shape
Summary dekhna: df.info()
Statistical summary: df.describe()
Columns list dekhna: df.columns
Missing values check karna: df.isnull().sum()

data cleaning

Duplicate rows hatana: df.drop_duplicates(inplace=True)
Missing values fill karna: df.fillna(value, inplace=True)
Missing values hataana: df.dropna(inplace=True)
Data type badalna: df['column'] = df['column'].astype(int)

In [17]:
data_csv

   Unnamed: 0   Name  Age  Salary     City
0           0   Arun   25   50000    Noida
1           1   Ravi   30   60000    Delhi
2           2  Mohan   22   52000   Mumbai
3           3   Sita   28   58000  Chennai
4           4  Geeta   24   55000     Pune

In [18]:
data_csv.drop(['Unnamed: 0'],axis=1,inplace= True)

In [19]:
data_csv

    Name  Age  Salary     City
0   Arun   25   50000    Noida
1   Ravi   30   60000    Delhi
2  Mohan   22   52000   Mumbai
3   Sita   28   58000  Chennai
4  Geeta   24   55000     Pune

data manipulation

4. Data Manipulation (Badlav aur Filtering)

    Naye column banana: df['new_col'] = df['col1'] + df['col2']
    Specific columns select karna: df[['col1', 'col2']]
    Rows filter karna: df[df['age'] > 25]
    Sort karna: df.sort_values(by='age', ascending=False)

In [1]:
import pandas as pd

# Creating the DataFrame
data = {
    
    'Name': ['Arun', 'Ravi', 'Mohan', 'Sita', 'Geeta'],
    'Age': [25, 30, 22, 28, 24],
    'Salary': [50000, 60000, 52000, 58000, 55000],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Chennai', 'Pune']
}

df = pd.DataFrame(data)

In [2]:
df

    Name  Age  Salary     City
0   Arun   25   50000    Noida
1   Ravi   30   60000    Delhi
2  Mohan   22   52000   Mumbai
3   Sita   28   58000  Chennai
4  Geeta   24   55000     Pune

In [3]:
# 1. Adding a new column 'Bonus' (10% of Salary)
df['Bonus'] = df['Salary'] * 0.10

In [4]:
df

    Name  Age  Salary     City   Bonus
0   Arun   25   50000    Noida  5000.0
1   Ravi   30   60000    Delhi  6000.0
2  Mohan   22   52000   Mumbai  5200.0
3   Sita   28   58000  Chennai  5800.0
4  Geeta   24   55000     Pune  5500.0

In [5]:
# 2. Selecting specific columns (Name and Salary)
selected_columns = df[['Name', 'Salary']]

In [6]:
selected_columns

    Name  Salary
0   Arun   50000
1   Ravi   60000
2  Mohan   52000
3   Sita   58000
4  Geeta   55000

In [10]:
# 3. Filtering rows (Employees older than 25)
#filtered_df = df[df['Age'] > 25]
old = df[df['Age'] > 25]
old

   Name  Age  Salary     City   Bonus
1  Ravi   30   60000    Delhi  6000.0
3  Sita   28   58000  Chennai  5800.0

In [13]:
# 4. Sorting by Age in descending order
#sorted_df = df.sort_values(by='Age', ascending=False)
sort_data = df.sort_values(by='Age',ascending=False)
sort_data

    Name  Age  Salary     City   Bonus
1   Ravi   30   60000    Delhi  6000.0
3   Sita   28   58000  Chennai  5800.0
0   Arun   25   50000    Noida  5000.0
4  Geeta   24   55000     Pune  5500.0
2  Mohan   22   52000   Mumbai  5200.0

In [ ]:
# Display the results
print("DataFrame with Bonus Column:\n", df)
print("\nSelected Columns (Name, Salary):\n", selected_columns)
print("\nFiltered Data (Age > 25):\n", filtered_df)
print("\nSorted Data by Age (Descending):\n", sorted_df)

5. Grouping & Aggregation


    Group by use karna: df.groupby('category')['sales'].sum()
    Pivot table banana: df.pivot_table(values='sales', index='month', columns='category', aggfunc='sum')

In [14]:
import pandas as pd

# Creating the DataFrame
data = {
    'Name': ['Arun', 'Ravi', 'Mohan', 'Sita', 'Geeta'],
    'Age': [25, 30, 22, 28, 24],
    'Salary': [50000, 60000, 52000, 58000, 55000],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Chennai', 'Pune']
}

df = pd.DataFrame(data)

In [16]:
# 1. Grouping by 'City' and summing the 'Salary'
grouped_df = df.groupby('City')['Salary'].sum()
grouped_df

City
Chennai    58000
Delhi      60000
Mumbai     52000
Noida      50000
Pune       55000
Name: Salary, dtype: int64

In [18]:
# 2. Creating a Pivot Table (Total Salary based on City and Age)
pivot_df = df.pivot_table(values='Salary', index='City', columns='Age', aggfunc='sum')
pivot_df

Age           22       24       25       28       30
City
Chennai      NaN      NaN      NaN  58000.0      NaN
Delhi        NaN      NaN      NaN      NaN  60000.0
Mumbai   52000.0      NaN      NaN      NaN      NaN
Noida        NaN      NaN  50000.0      NaN      NaN
Pune         NaN  55000.0      NaN      NaN      NaN

In [19]:
# Display the results
print("Grouped Data (Total Salary by City):\n", grouped_df)
print("\nPivot Table (Salary by City & Age):\n", pivot_df)

Grouped Data (Total Salary by City):
 City
Chennai    58000
Delhi      60000
Mumbai     52000
Noida      50000
Pune       55000
Name: Salary, dtype: int64

Pivot Table (Salary by City & Age):
 Age           22       24       25       28       30
City
Chennai      NaN      NaN      NaN  58000.0      NaN
Delhi        NaN      NaN      NaN      NaN  60000.0
Mumbai   52000.0      NaN      NaN      NaN      NaN
Noida        NaN      NaN  50000.0      NaN      NaN
Pune         NaN  55000.0      NaN      NaN      NaN

time series analysis

In [9]:
import pandas as pd

# Sample time series data
data = {
    'date': ['2023-01-01', '2023-01-05', '2023-02-10', '2023-02-15', '2023-03-20'],
    'value': [10, 20, 30, 25, 40]
}

# DataFrame create karna
df = pd.DataFrame(data)

In [10]:
df

         date  value
0  2023-01-01     10
1  2023-01-05     20
2  2023-02-10     30
3  2023-02-15     25
4  2023-03-20     40

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5 non-null      object
 1   value   5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [12]:
df['date'] = pd.to_datetime(df['date'])

In [3]:
# 1️⃣ Date column ko datetime me convert karna
df['date'] = pd.to_datetime(df['date'])

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5 non-null      datetime64[ns]
 1   value   5 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 212.0 bytes

In [14]:
# 2️⃣ Index ko datetime set karna
df.set_index('date', inplace=True)

In [15]:
df

            value
date
2023-01-01     10
2023-01-05     20
2023-02-10     30
2023-02-15     25
2023-03-20     40

In [18]:
# 3️⃣ Resampling (Monthly average nikalna)
monthly_avg = df.resample('M').sum()

In [19]:
# Output print karna
print(monthly_avg)

            value
date
2023-01-31     30
2023-02-28     55
2023-03-31     40

advanced apply function

In [20]:
import pandas as pd

# Sample DataFrame
data = {'old_col': [10, 20, 30, 40]}
df = pd.DataFrame(data)

In [21]:
# Apply function ka use (Har value ko 2 se multiply)
df['new_col'] = df['old_col'].apply(lambda x: x * 2)

print(df)

   old_col  new_col
0       10       20
1       20       40
2       30       60
3       40       80